
## Plan Result (portfolio/base_apne1)

[CI link](https://github.com/tqer39/terraform-aws/actions/runs/4586921724)


### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 0 to add, 5 to change, 1 to destroy.</code></pre>

* Update
  * aws_iam_policy.deploy_allow_specifics
  * aws_iam_policy.deploy_deny_specifics
  * module.deploy_role.aws_iam_role.this
  * module.oidc_github_actions_id_provider.aws_iam_openid_connect_provider.this
  * module.tfstate_s3_bucket.module.s3_bucket.aws_s3_bucket.this
* Delete
  * module.deploy_role.aws_iam_policy.this


<details><summary>Change Result (Click me)</summary>

```hcl

  # aws_iam_policy.deploy_allow_specifics will be updated in-place
  ~ resource "aws_iam_policy" "deploy_allow_specifics" {
        id        = "arn:aws:iam::072693953877:policy/deploy-allow-specifics"
        name      = "deploy-allow-specifics"
      ~ tags      = {
          - "pl:repository" = "LifeTechEase/terraform-aws" -> null
        }
      ~ tags_all  = {
          ~ "pl:repository"  = "LifeTechEase/terraform-aws" -> "tqer39/terraform-aws"
            # (5 unchanged elements hidden)
        }
        # (4 unchanged attributes hidden)
    }

  # aws_iam_policy.deploy_deny_specifics will be updated in-place
  ~ resource "aws_iam_policy" "deploy_deny_specifics" {
        id        = "arn:aws:iam::072693953877:policy/deploy-deny-specifics"
        name      = "deploy-deny-specifics"
      ~ tags      = {
          - "pl:repository" = "LifeTechEase/terraform-aws" -> null
        }
      ~ tags_all  = {
          ~ "pl:repository"  = "LifeTechEase/terraform-aws" -> "tqer39/terraform-aws"
            # (5 unchanged elements hidden)
        }
        # (4 unchanged attributes hidden)
    }

  # module.deploy_role.data.aws_iam_policy.deploy_allow_specifics will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy" "deploy_allow_specifics" {
      + arn         = (known after apply)
      + description = (known after apply)
      + id          = (known after apply)
      + name        = "deploy-allow-specifics"
      + path        = (known after apply)
      + policy      = (known after apply)
      + policy_id   = (known after apply)
      + tags        = (known after apply)
    }

  # module.deploy_role.data.aws_iam_policy.deploy_deny_specifics will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy" "deploy_deny_specifics" {
      + arn         = (known after apply)
      + description = (known after apply)
      + id          = (known after apply)
      + name        = "deploy-deny-specifics"
      + path        = (known after apply)
      + policy      = (known after apply)
      + policy_id   = (known after apply)
      + tags        = (known after apply)
    }

  # module.deploy_role.data.aws_iam_policy_document.assume_role will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "assume_role" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions = [
              + "sts:AssumeRoleWithWebIdentity",
            ]

          + condition {
              + test     = "StringLike"
              + values   = [
                  + "repo:tqer39/terraform-aws:*",
                ]
              + variable = "token.actions.githubusercontent.com:sub"
            }

          + principals {
              + identifiers = [
                  + "arn:aws:iam::072693953877:oidc-provider/token.actions.githubusercontent.com",
                ]
              + type        = "Federated"
            }
        }
    }

  # module.deploy_role.aws_iam_policy.this will be destroyed
  # (because aws_iam_policy.this is not in configuration)
  - resource "aws_iam_policy" "this" {
      - arn       = "arn:aws:iam::072693953877:policy/portfolio-private-lab-deploy" -> null
      - id        = "arn:aws:iam::072693953877:policy/portfolio-private-lab-deploy" -> null
      - name      = "portfolio-private-lab-deploy" -> null
      - path      = "/" -> null
      - policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "lambda:*",
                          - "apigateway:*",
                          - "ec2:*",
                          - "rds:*",
                          - "s3:*",
                          - "sns:*",
                          - "states:*",
                          - "ssm:*",
                          - "sqs:*",
                          - "iam:*",
                          - "elasticloadbalancing:*",
                          - "autoscaling:*",
                          - "cloudwatch:*",
                          - "cloudfront:*",
                          - "route53:*",
                          - "ecr:*",
                          - "logs:*",
                          - "ecs:*",
                          - "application-autoscaling:*",
                          - "events:*",
                          - "elasticache:*",
                          - "es:*",
                          - "kms:*",
                          - "dynamodb:*",
                          - "kinesis:*",
                          - "firehose:*",
                          - "elasticbeanstalk:*",
                          - "cloudformation:*",
                          - "acm:*",
                          - "organizations:*",
                          - "sso:*",
                          - "identitystore:*",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                      - Sid      = "AllowSpecifics"
                    },
                  - {
                      - Action   = [
                          - "iam:*Login*",
                          - "iam:*Group*",
                          - "aws-portal:*",
                          - "budgets:*",
                          - "config:*",
                          - "directconnect:*",
                          - "aws-marketplace:*",
                          - "aws-marketplace-management:*",
                          - "ec2:*ReservedInstances*",
                        ]
                      - Effect   = "Deny"
                      - Resource = "*"
                      - Sid      = "DenySpecifics"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - policy_id = "ANPARB3HFWVKXTUKPMB5J" -> null
      - tags      = {
          - "pl:product"     = "private-lab"
          - "pl:repository"  = "tqer39/private-lab"
          - "pl:source_path" = "https://github.com/tqer39/private-lab/tree/main/terraform/environments/portfolio/base_apne1"
        } -> null
      - tags_all  = {
          - "pl:environment" = "portfolio"
          - "pl:iac"         = "terraform"
          - "pl:owner"       = "tqer39+aws-portfolio@gmail.com"
          - "pl:product"     = "private-lab"
          - "pl:repository"  = "tqer39/private-lab"
          - "pl:source_path" = "https://github.com/tqer39/private-lab/tree/main/terraform/environments/portfolio/base_apne1"
        } -> null
    }

  # module.deploy_role.aws_iam_role.this will be updated in-place
  ~ resource "aws_iam_role" "this" {
      ~ assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRoleWithWebIdentity"
                      - Condition = {
                          - StringLike = {
                              - "token.actions.githubusercontent.com:sub" = "repo:tqer39/terraform-aws:*"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - Federated = "arn:aws:iam::072693953877:oidc-provider/token.actions.githubusercontent.com"
                        }
                      - Sid       = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        id                    = "portfolio-terraform-aws-deploy"
      ~ managed_policy_arns   = [
          - "arn:aws:iam::072693953877:policy/deploy-allow-specifics",
          - "arn:aws:iam::072693953877:policy/deploy-deny-specifics",
        ] -> (known after apply)
        name                  = "portfolio-terraform-aws-deploy"
      ~ tags                  = {
          - "pl:repository" = "LifeTechEase/terraform-aws" -> null
        }
      ~ tags_all              = {
          ~ "pl:repository"  = "LifeTechEase/terraform-aws" -> "tqer39/terraform-aws"
            # (5 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)
    }

  # module.oidc_github_actions_id_provider.aws_iam_openid_connect_provider.this will be updated in-place
  ~ resource "aws_iam_openid_connect_provider" "this" {
        id              = "arn:aws:iam::072693953877:oidc-provider/token.actions.githubusercontent.com"
      ~ tags            = {
          - "pl:repository" = "LifeTechEase/terraform-aws" -> null
        }
      ~ tags_all        = {
          ~ "pl:repository"  = "LifeTechEase/terraform-aws" -> "tqer39/terraform-aws"
            # (5 unchanged elements hidden)
        }
        # (4 unchanged attributes hidden)
    }

  # module.tfstate_s3_bucket.module.s3_bucket.aws_s3_bucket.this will be updated in-place
  ~ resource "aws_s3_bucket" "this" {
        id                          = "terraform-tfstate-tqer39-072693953877-ap-northeast-1"
      ~ tags                        = {
          - "pl:repository" = "LifeTechEase/terraform-aws" -> null
        }
      ~ tags_all                    = {
          ~ "pl:repository"  = "LifeTechEase/terraform-aws" -> "tqer39/terraform-aws"
            # (5 unchanged elements hidden)
        }
        # (9 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

Plan: 0 to add, 5 to change, 1 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"terraform","PRNumber":194,"Program":"tfcmt","SHA1":"049fce3a6c368783dc5c2afeaccf9fe8b2c6ad5e","Target":"portfolio/base_apne1","Vars":{},"WorkflowName":"Terraform - AWS - Portfolio"} -->